Repository: naisofttr/TarifAI
Catalog: lib/l10n/app_*.arb
Languages: tr

source: Add ingredient
tr: Malzeme ekle

# ingredientHint
source: Enter ingredient name
tr: Malzeme ismi girin

# ingredientLabel
source: Ingredient
tr: Malzeme

source: Added Ingredients:
tr: Eklenen Malzemeler:

source: Clear all ingredients
tr: Tüm malzemeleri temizle

source: List Recipes
tr: Tarifleri Listele

source: Suggested Recipes:
tr: Önerilen Tarifler:

# pleaseAddIngredient
source: Please add at least one ingredient
tr: Lütfen en az bir malzeme ekleyin

# error
source: Error occurred: {error}
tr: Hata oluştu: {error}

source: Login
tr: Giriş Yap

# welcomeTitle
source: Welcome to TarifAI!
tr: TarifAI'ya Hoş Geldiniz!

# welcomeDescription
source: Enter the ingredients you have, and I'll suggest delicious recipes you can make.
tr: Elinizde olan malzemeleri girin, size yapabileceğiniz lezzetli tarifleri önereyim.

# noIngredientsMessage
source: Start by adding ingredients you have in your kitchen
tr: Mutfağınızda olan malzemeleri eklemeye başlayın

# addIngredientButtonTooltip
source: Add this ingredient to your list
tr: Bu malzemeyi listenize ekleyin

# ingredientInputHelper
source: Type an ingredient and press + or Enter
tr: Bir malzeme yazın ve + tuşuna veya Enter'a basın

# ingredientAlreadyExists
source: This ingredient is already in your list
tr: Bu malzeme zaten listenizde mevcut
